GopalSaraf/Practicals/PSDL/include/proc/pic16lf707.inc
// Register: CPSACON0
#define CPSACON0 CPSACON0
CPSACON0                                 equ 0108h
// bitfield definitions
CPSACON0_TAXCS_POSN                      equ 0000h
CPSACON0_TAXCS_POSITION                  equ 0000h
CPSACON0_TAXCS_SIZE                      equ 0001h
CPSACON0_TAXCS_LENGTH                    equ 0001h
CPSACON0_TAXCS_MASK                      equ 0001h
CPSACON0_CPSAOUT_POSN                    equ 0001h
CPSACON0_CPSAOUT_POSITION                equ 0001h
CPSACON0_CPSAOUT_SIZE                    equ 0001h
CPSACON0_CPSAOUT_LENGTH                  equ 0001h
CPSACON0_CPSAOUT_MASK                    equ 0002h
CPSACON0_CPSARNG_POSN                    equ 0002h
CPSACON0_CPSARNG_POSITION                equ 0002h
CPSACON0_CPSARNG_SIZE                    equ 0002h
CPSACON0_CPSARNG_LENGTH                  equ 0002h
CPSACON0_CPSARNG_MASK                    equ 000Ch
CPSACON0_CPSARM_POSN                     equ 0006h
CPSACON0_CPSARM_POSITION                 equ 0006h
CPSACON0_CPSARM_SIZE                     equ 0001h
CPSACON0_CPSARM_LENGTH                   equ 0001h
CPSACON0_CPSARM_MASK                     equ 0040h
CPSACON0_CPSAON_POSN                     equ 0007h
CPSACON0_CPSAON_POSITION                 equ 0007h
CPSACON0_CPSAON_SIZE                     equ 0001h
CPSACON0_CPSAON_LENGTH                   equ 0001h
CPSACON0_CPSAON_MASK                     equ 0080h
CPSACON0_CPSARNG0_POSN                   equ 0002h
CPSACON0_CPSARNG0_POSITION               equ 0002h
CPSACON0_CPSARNG0_SIZE                   equ 0001h
CPSACON0_CPSARNG0_LENGTH                 equ 0001h
CPSACON0_CPSARNG0_MASK                   equ 0004h
CPSACON0_CPSARNG1_POSN                   equ 0003h
CPSACON0_CPSARNG1_POSITION               equ 0003h
CPSACON0_CPSARNG1_SIZE                   equ 0001h
CPSACON0_CPSARNG1_LENGTH                 equ 0001h
CPSACON0_CPSARNG1_MASK                   equ 0008h

// Register: CPSACON1
#define CPSACON1 CPSACON1
CPSACON1                                 equ 0109h
// bitfield definitions
CPSACON1_CPSACH_POSN                     equ 0000h
CPSACON1_CPSACH_POSITION                 equ 0000h
CPSACON1_CPSACH_SIZE                     equ 0004h
CPSACON1_CPSACH_LENGTH                   equ 0004h
CPSACON1_CPSACH_MASK                     equ 000Fh
CPSACON1_CPSACH0_POSN                    equ 0000h
CPSACON1_CPSACH0_POSITION                equ 0000h
CPSACON1_CPSACH0_SIZE                    equ 0001h
CPSACON1_CPSACH0_LENGTH                  equ 0001h
CPSACON1_CPSACH0_MASK                    equ 0001h
CPSACON1_CPSACH1_POSN                    equ 0001h
CPSACON1_CPSACH1_POSITION                equ 0001h
CPSACON1_CPSACH1_SIZE                    equ 0001h
CPSACON1_CPSACH1_LENGTH                  equ 0001h
CPSACON1_CPSACH1_MASK                    equ 0002h
CPSACON1_CPSACH2_POSN                    equ 0002h
CPSACON1_CPSACH2_POSITION                equ 0002h
CPSACON1_CPSACH2_SIZE                    equ 0001h
CPSACON1_CPSACH2_LENGTH                  equ 0001h
CPSACON1_CPSACH2_MASK                    equ 0004h
CPSACON1_CPSACH3_POSN                    equ 0003h
CPSACON1_CPSACH3_POSITION                equ 0003h
CPSACON1_CPSACH3_SIZE                    equ 0001h
CPSACON1_CPSACH3_LENGTH                  equ 0001h
CPSACON1_CPSACH3_MASK                    equ 0008h

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 010Ch

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 010Dh

// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 010Eh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 010Fh

// Register: TMRA
#define TMRA TMRA
TMRA                                     equ 0110h

// Register: TBCON
#define TBCON TBCON
TBCON                                    equ 0111h
// bitfield definitions
TBCON_TBPS_POSN                          equ 0000h
TBCON_TBPS_POSITION                      equ 0000h
TBCON_TBPS_SIZE                          equ 0003h
TBCON_TBPS_LENGTH                        equ 0003h
TBCON_TBPS_MASK                          equ 0007h
TBCON_TBPSA_POSN                         equ 0003h
TBCON_TBPSA_POSITION                     equ 0003h
TBCON_TBPSA_SIZE                         equ 0001h
TBCON_TBPSA_LENGTH                       equ 0001h
TBCON_TBPSA_MASK                         equ 0008h
TBCON_TBSE_POSN                          equ 0004h
TBCON_TBSE_POSITION                      equ 0004h
TBCON_TBSE_SIZE                          equ 0001h
TBCON_TBSE_LENGTH                        equ 0001h
TBCON_TBSE_MASK                          equ 0010h
TBCON_TBCS_POSN                          equ 0005h
TBCON_TBCS_POSITION                      equ 0005h
TBCON_TBCS_SIZE                          equ 0001h
TBCON_TBCS_LENGTH                        equ 0001h
TBCON_TBCS_MASK                          equ 0020h
TBCON_TMRBON_POSN                        equ 0007h
TBCON_TMRBON_POSITION                    equ 0007h
TBCON_TMRBON_SIZE                        equ 0001h
TBCON_TMRBON_LENGTH                      equ 0001h
TBCON_TMRBON_MASK                        equ 0080h
TBCON_TBPS0_POSN                         equ 0000h
TBCON_TBPS0_POSITION                     equ 0000h
TBCON_TBPS0_SIZE                         equ 0001h
TBCON_TBPS0_LENGTH                       equ 0001h
TBCON_TBPS0_MASK                         equ 0001h
TBCON_TBPS1_POSN                         equ 0001h
TBCON_TBPS1_POSITION                     equ 0001h
TBCON_TBPS1_SIZE                         equ 0001h
TBCON_TBPS1_LENGTH                       equ 0001h
TBCON_TBPS1_MASK                         equ 0002h
TBCON_TBPS2_POSN                         equ 0002h
TBCON_TBPS2_POSITION                     equ 0002h
TBCON_TBPS2_SIZE                         equ 0001h
TBCON_TBPS2_LENGTH                       equ 0001h
TBCON_TBPS2_MASK                         equ 0004h
TBCON_TMRBPS_POSN                        equ 0000h
TBCON_TMRBPS_POSITION                    equ 0000h
TBCON_TMRBPS_SIZE                        equ 0003h
TBCON_TMRBPS_LENGTH                      equ 0003h
TBCON_TMRBPS_MASK                        equ 0007h
TBCON_TMRBPSA_POSN                       equ 0003h
TBCON_TMRBPSA_POSITION                   equ 0003h
TBCON_TMRBPSA_SIZE                       equ 0001h
TBCON_TMRBPSA_LENGTH                     equ 0001h
TBCON_TMRBPSA_MASK                       equ 0008h
TBCON_TMRBSE_POSN                        equ 0004h
TBCON_TMRBSE_POSITION                    equ 0004h
TBCON_TMRBSE_SIZE                        equ 0001h
TBCON_TMRBSE_LENGTH                      equ 0001h
TBCON_TMRBSE_MASK                        equ 0010h
TBCON_TMRBCS_POSN                        equ 0005h
TBCON_TMRBCS_POSITION                    equ 0005h
TBCON_TMRBCS_SIZE                        equ 0001h
TBCON_TMRBCS_LENGTH                      equ 0001h
TBCON_TMRBCS_MASK                        equ 0020h
TBCON_TMRBPS0_POSN                       equ 0000h
TBCON_TMRBPS0_POSITION                   equ 0000h
TBCON_TMRBPS0_SIZE                       equ 0001h
TBCON_TMRBPS0_LENGTH                     equ 0001h
TBCON_TMRBPS0_MASK                       equ 0001h
TBCON_TMRBPS1_POSN                       equ 0001h
TBCON_TMRBPS1_POSITION                   equ 0001h
TBCON_TMRBPS1_SIZE                       equ 0001h
TBCON_TMRBPS1_LENGTH                     equ 0001h
TBCON_TMRBPS1_MASK                       equ 0002h
TBCON_TMRBPS2_POSN                       equ 0002h
TBCON_TMRBPS2_POSITION                   equ 0002h
TBCON_TMRBPS2_SIZE                       equ 0001h
TBCON_TMRBPS2_LENGTH                     equ 0001h
TBCON_TMRBPS2_MASK                       equ 0004h

